
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2024.2.294.1.19
# Date: 2024-06-21 16:44

# Copyright (C) 2013 - 2024 Efinix Inc. All rights reserved.

# Device: Ti60F225
# Project: LED_8bit_Test
# Timing Model: C4 (final)

# PLL Constraints
#################
create_clock -period 10.417 -name pll_inst1_CLKOUT0 [get_ports {pll_inst1_CLKOUT0}]
create_clock -period 40.064 -name clk_pixel_parallel [get_ports {clk_pixel_parallel}]
create_clock -waveform {1.002 3.005} -period 4.006 -name clk_pixel_serial [get_ports {clk_pixel_serial}]

# GPIO Constraints
####################
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[7]}]

# JTAG Constraints
####################
# create_clock -period <USER_PERIOD> -name jtag_inst2_TCK [get_ports {jtag_inst2_TCK}]
set_output_delay -clock jtag_inst2_TCK -max 1.321 [get_ports {jtag_inst2_TDO}]
set_output_delay -clock jtag_inst2_TCK -min 0.495 [get_ports {jtag_inst2_TDO}]
set_input_delay -clock_fall -clock jtag_inst2_TCK -max 0.125 [get_ports {jtag_inst2_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst2_TCK -min 0.077 [get_ports {jtag_inst2_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst2_TCK -max 0.660 [get_ports {jtag_inst2_RESET}]
set_input_delay -clock_fall -clock jtag_inst2_TCK -min 0.401 [get_ports {jtag_inst2_RESET}]
set_input_delay -clock_fall -clock jtag_inst2_TCK -max 0.204 [get_ports {jtag_inst2_SEL}]
set_input_delay -clock_fall -clock jtag_inst2_TCK -min 0.025 [get_ports {jtag_inst2_SEL}]
set_input_delay -clock_fall -clock jtag_inst2_TCK -max 0.153 [get_ports {jtag_inst2_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst2_TCK -min 0.074 [get_ports {jtag_inst2_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst2_TCK -max 0.172 [get_ports {jtag_inst2_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst2_TCK -min 0.055 [get_ports {jtag_inst2_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst2_TCK -max 1.035 [get_ports {jtag_inst2_DRCK}]
set_input_delay -clock_fall -clock jtag_inst2_TCK -min 0.620 [get_ports {jtag_inst2_DRCK}]
# JTAG Constraints (extra... not used by current Efinity debug tools)
# create_clock -period <USER_PERIOD> -name jtag_inst2_DRCK [get_ports {jtag_inst2_DRCK}]
# set_input_delay -clock_fall -clock jtag_inst2_TCK -max 0.147 [get_ports {jtag_inst2_RUNTEST}]
# set_input_delay -clock_fall -clock jtag_inst2_TCK -min 0.066 [get_ports {jtag_inst2_RUNTEST}]
# Create separate clock groups for JTAG clocks. Remove DRCK clock from the list below if it is not defined.
# set_clock_groups -asynchronous -group {jtag_inst2_TCK jtag_inst2_DRCK}

# HSIO GPIO Constraints
#########################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {uart_rx}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {uart_rx}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {uart_tx}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {uart_tx}]

# LVDS Tx Constraints
#######################
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~63~322}] -max 0.378 [get_ports {tmds_lvds_tx_clk_o[*]}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~63~322}] -min -0.140 [get_ports {tmds_lvds_tx_clk_o[*]}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~63~322}] -max 0.378 [get_ports {tmds_lvds_tx_clk_oe}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~63~322}] -min -0.140 [get_ports {tmds_lvds_tx_clk_oe}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~195~322}] -max 0.378 [get_ports {tmds_lvds_tx_data0[*]}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~195~322}] -min -0.140 [get_ports {tmds_lvds_tx_data0[*]}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~195~322}] -max 0.378 [get_ports {tmds_lvds_tx_data0_oe}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~195~322}] -min -0.140 [get_ports {tmds_lvds_tx_data0_oe}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~31~322}] -max 0.378 [get_ports {tmds_lvds_tx_data1[*]}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~31~322}] -min -0.140 [get_ports {tmds_lvds_tx_data1[*]}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~31~322}] -max 0.378 [get_ports {tmds_lvds_tx_data1_oe}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~31~322}] -min -0.140 [get_ports {tmds_lvds_tx_data1_oe}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~55~322}] -max 0.378 [get_ports {tmds_lvds_tx_data2[*]}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~55~322}] -min -0.140 [get_ports {tmds_lvds_tx_data2[*]}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~55~322}] -max 0.378 [get_ports {tmds_lvds_tx_data2_oe}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~55~322}] -min -0.140 [get_ports {tmds_lvds_tx_data2_oe}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~63~322}] -max 0.420 [get_ports {tmds_lvds_tx_clk_rst}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~63~322}] -min -0.175 [get_ports {tmds_lvds_tx_clk_rst}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~195~322}] -max 0.420 [get_ports {tmds_lvds_tx_data0_rst}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~195~322}] -min -0.175 [get_ports {tmds_lvds_tx_data0_rst}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~31~322}] -max 0.420 [get_ports {tmds_lvds_tx_data1_rst}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~31~322}] -min -0.175 [get_ports {tmds_lvds_tx_data1_rst}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~55~322}] -max 0.420 [get_ports {tmds_lvds_tx_data2_rst}]
set_output_delay -clock clk_pixel_parallel -reference_pin [get_ports {clk_pixel_parallel~CLKOUT~55~322}] -min -0.175 [get_ports {tmds_lvds_tx_data2_rst}]

# Clock Latency Constraints
############################
# set_clock_latency -source -setup <board_max + 1.907> [get_ports {pll_inst1_CLKOUT0}]
# set_clock_latency -source -hold <board_min + 1.271> [get_ports {pll_inst1_CLKOUT0}]
# set_clock_latency -source -setup <board_max + 1.907> [get_ports {clk_pixel_parallel}]
# set_clock_latency -source -hold <board_min + 1.271> [get_ports {clk_pixel_parallel}]
# set_clock_latency -source -setup <board_max + 1.907> [get_ports {clk_pixel_serial}]
# set_clock_latency -source -hold <board_min + 1.271> [get_ports {clk_pixel_serial}]
