
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2024.2.294.1.19
# Date: 2024-06-21 16:33

# Copyright (C) 2013 - 2024 Efinix Inc. All rights reserved.

# Device: Ti60F225
# Project: Ti60_HDMI_CharDsiplay720P
# Timing Model: C4 (final)

# PLL Constraints
#################
create_clock -period 41.667 -name pll_inst2_CLKOUT0 [get_ports {pll_inst2_CLKOUT0}]
create_clock -period 37.037 -name clk27m [get_ports {clk27m}]
create_clock -period 25.000 -name clk_adc [get_ports {clk_adc}]
create_clock -period 37.037 -name clk_ref [get_ports {clk_ref}]
create_clock -period 13.468 -name clk_pixel [get_ports {clk_pixel}]
create_clock -waveform {0.673 2.020} -period 2.694 -name clk_pixel_5x [get_ports {clk_pixel_5x}]

# GPIO Constraints
####################
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_o[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_o[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_o[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_o[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_o[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_o[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_o[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_o[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_o[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_o[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_o[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_o[5]}]

# HSIO GPIO Constraints
#########################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DAM[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DAM[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DAM[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DAM[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DAM[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DAM[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DAM[3]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DAM[3]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DAM[4]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DAM[4]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DAM[5]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DAM[5]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DAM[6]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DAM[6]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DAM[7]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DAM[7]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DBN[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DBN[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DBN[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DBN[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DBN[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DBN[2]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DBN[3]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DBN[3]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DBN[4]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DBN[4]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DBN[5]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DBN[5]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DBN[6]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DBN[6]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {DBN[7]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {DBN[7]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {key_change}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {key_change}]

# LVDS Tx Constraints
#######################
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~63~322}] -max 0.378 [get_ports {tmds_lvds_tx_clk_o[*]}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~63~322}] -min -0.140 [get_ports {tmds_lvds_tx_clk_o[*]}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~63~322}] -max 0.378 [get_ports {tmds_lvds_tx_clk_oe}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~63~322}] -min -0.140 [get_ports {tmds_lvds_tx_clk_oe}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~195~322}] -max 0.378 [get_ports {tmds_lvds_tx_data0[*]}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~195~322}] -min -0.140 [get_ports {tmds_lvds_tx_data0[*]}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~195~322}] -max 0.378 [get_ports {tmds_lvds_tx_data0_oe}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~195~322}] -min -0.140 [get_ports {tmds_lvds_tx_data0_oe}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~31~322}] -max 0.378 [get_ports {tmds_lvds_tx_data1[*]}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~31~322}] -min -0.140 [get_ports {tmds_lvds_tx_data1[*]}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~31~322}] -max 0.378 [get_ports {tmds_lvds_tx_data1_oe}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~31~322}] -min -0.140 [get_ports {tmds_lvds_tx_data1_oe}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~55~322}] -max 0.378 [get_ports {tmds_lvds_tx_data2[*]}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~55~322}] -min -0.140 [get_ports {tmds_lvds_tx_data2[*]}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~55~322}] -max 0.378 [get_ports {tmds_lvds_tx_data2_oe}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~55~322}] -min -0.140 [get_ports {tmds_lvds_tx_data2_oe}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~63~322}] -max 0.420 [get_ports {tmds_lvds_tx_clk_rst}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~63~322}] -min -0.175 [get_ports {tmds_lvds_tx_clk_rst}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~195~322}] -max 0.420 [get_ports {tmds_lvds_tx_data0_rst}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~195~322}] -min -0.175 [get_ports {tmds_lvds_tx_data0_rst}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~31~322}] -max 0.420 [get_ports {tmds_lvds_tx_data1_rst}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~31~322}] -min -0.175 [get_ports {tmds_lvds_tx_data1_rst}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~55~322}] -max 0.420 [get_ports {tmds_lvds_tx_data2_rst}]
set_output_delay -clock clk_pixel -reference_pin [get_ports {clk_pixel~CLKOUT~55~322}] -min -0.175 [get_ports {tmds_lvds_tx_data2_rst}]

# Clock Latency Constraints
############################
# set_clock_latency -source -setup <board_max + 1.907> [get_ports {pll_inst2_CLKOUT0}]
# set_clock_latency -source -hold <board_min + 1.271> [get_ports {pll_inst2_CLKOUT0}]
# set_clock_latency -source -setup <board_max + 1.907> [get_ports {clk27m}]
# set_clock_latency -source -hold <board_min + 1.271> [get_ports {clk27m}]
# set_clock_latency -source -setup <board_max + 1.907> [get_ports {clk_adc}]
# set_clock_latency -source -hold <board_min + 1.271> [get_ports {clk_adc}]
# set_clock_latency -source -setup <pll_clk_latency_clk27m_max + 1.820> [get_ports {clk_ref}]
# set_clock_latency -source -hold <pll_clk_latency_clk27m_min + 1.178> [get_ports {clk_ref}]
# set_clock_latency -source -setup <pll_clk_latency_clk27m_max + 1.820> [get_ports {clk_pixel}]
# set_clock_latency -source -hold <pll_clk_latency_clk27m_min + 1.178> [get_ports {clk_pixel}]
# set_clock_latency -source -setup <pll_clk_latency_clk27m_max + 1.820> [get_ports {clk_pixel_5x}]
# set_clock_latency -source -hold <pll_clk_latency_clk27m_min + 1.178> [get_ports {clk_pixel_5x}]
